# Задание 3
a = int(input('Введите число:'))
b = a + (a*11) + (a*111)
print(b)